Revit 2027 API
BuiltInFailures.UniqueElementFailures Class
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.UniqueElementFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class UniqueElementFailures
Public NotInheritable Class UniqueElementFailures
public ref class UniqueElementFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type UniqueElementFailures = class end
The BuiltInFailures.UniqueElementFailures type exposes the following members.
Properties
Name | Description
ProhibitUniqueElementDeletion |  Internal setting '%1!s!' is required by Revit and has been deleted.
Top
See Also
Reference
Autodesk.Revit.DB Namespace